// 符号键盘字符
export const SYMBOL_CODE = {
  line1: ['[', ']', '{', '}', '+', '-', '*', '/', '%', '='],
  line2: ['_', '—', '|', '~', '^', '《', '》', '$', '&',],
  line3: ['#+=', '……', ',', '?', '!', '.', '’', '\'', "delete"]
}

// 默认键盘字符
export const DEFAULT_CODE = {
  line1: ['q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p'],
  line2: ['a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l'],
  line3: ['upper', 'z', 'x', 'c', 'v', 'b', 'n', 'm', "delete"]
}

// 数字键盘字符
export const NUMBER_CODE = {
  line1: ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
  line2: ['-', '/', ':', '(', ')', '¥', '@', '“', '”'],
  line3: ['#+=', '。', '，', '、', '？', '！', '.', ';', "delete"]
}